{ "news": [
	{"title": "WSJ: IBM gives Chinese officials (limited) access to its source code", "text": "IBM has reportedly started holding demonstrations to show off an unspecified product's source code to people outside the company -- particularly to officials from China's Ministry of Industry and Information Technology, according to The Wall Street Journal. The Asian superpower has been asking tech companies for access to their programs' codes, which are typically closely guarded secrets, for quite some time. Apparently, it wants to make sure the US hasn't installed backdoors on American-made software as a way to spy on its citizens.",
		"image":"http://o.aolcdn.com/dims-shared/dims3/GLOB/crop/1454x893+0+71/resize/1200x738!/format/jpg/quality/85/http://hss-prod.hss.aol.com/hss/storage/midas/68ee9bc111b63cc41fa5e66828a8faa4/202819241/5494014657_9c39929295.jpg"

	},
	{
	"title": "Wanna quit your job and become Upwork freelancer? Do not do that!",
	"text":
		"<h3> Wanna quit your job and become Upwork freelancer? Do not do that! </h3> Almost every day I receive job offers on my 5 star odesk (upwork) <a rel=\"nofollow\" href=\"https://www.upwork.com/freelancers/~014b94f689ffe58e7c\" target=\"_blank\">profile</a>. I do not search anything manually, clients contacting me directly. But most of these job offers are really garbage. <br/> <br/>  Real example. Couple days ago some R.D. from United States contacted me. She wanted to do website scrape. <br/><br/>  Ok, after doing quick website check, job seems straightforward. Huge list of categories/subcategories and product listings. Nothing unusual. <br/><br/>  The next part is to set the price for the job. Usually I would say: Ok, data scrape will cost you $75. Then client approves/declines. But this time I decided to give chance my client decide how much she would like to pay. So I simply said: <br/> <br/>   <b><i>\"Just send me an offer with price that is ok for you.\" </i></b> <br/><br/>  Then she asks me if I can also deliver script. I said that I can deliver script as well, but it would cost more expensive, since I need to clean the code, make it user friendly and easy to run. And what is the result? How much do you think she evaluated my work? Below is her answer: <br/><br/>   <b><i> \"Since this site is so big I was thinking having the script itself might make sense rather than reaching out each time for every random vertical - otherwise I'd have to ping you again. We have a dev team here and I studied CS, so I don't need it to be beautiful code, just functional. &#55357;&#56836; <br/><br/>  But for right now, let's start with the data for the food one. I had been paying $3/hr for manual data entry. Would $15 be fair to you for this category?\"</i></b><br/><br/>   Great. She had been paying $3/hr for manual copy paste for some indian/filipino guy/girl without any programming skills. My skills she evaluates the same - $3/hr. Even my profile states $15 per hour. Or probably she's thinking that's possible to develop script, scrape the data and deliver functional code to her just in 1 hour at $15? No further discussion.<br/><br/>  Where these all people are from, who want me to work for $1-$3/hr? Guys, this is not serious and not funny. I'm saying NO to free labor!<br/><br/><br/>  <b>Update.</b> For those who got offended by words \"indian/filipino\", try to create job post on odesk and see who apply. I'm almost sure that 90% of applicants from those countries with very low rate/quality of work (I have own experience). That's why I'm thinking previous manual data entry person from there (anyway I might be wrong).",
		"image":"http://1.bp.blogspot.com/-3T_PmhLonjc/VhW6LZV54oI/AAAAAAAABlM/QBaAvsLMV2k/s1600/serg_profile.jpeg"
	},
	{"title": "CEOs beware: Your astronomical salaries may soon cost you customers", "text": "The upward march of chief executive salaries is a sore point in the debate over rising income inequality in America. Forty years ago, chief executives at large companies earned only about 20 times the average worker's salary. In the 90s, the pay gap widened to ten times that size. Economists like Paul Krugman have argued that this happened in part because social norms changed. Multi-million dollar salaries began to seem, well, less unseemly.",
		"image":"https://img.washingtonpost.com/wp-apps/imrs.php?src=https://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Images/2015-08-07/Bloomberg/230091734.jpg&w=1484"

	},
	{"title": "OS X El Capitan License: in Plain English", "text": "And so I did what anyone else would: I cleared my afternoon schedule and got right down to business; reading, carefully, the entire document. It turns out that I was much too pessimistic! I needed only 33 minutes.    I should note that I'm an attorney with a good understanding of license, trademark, and copyright law. I'm also a software developer with 20 years' experience. So your own read-through may take more or less time, accordingly.I thought it'd be a \"fun\" project to see what the \"El Capitan License\" actually says. Cool idea, huh? Kind of like spelunking through a cave that everyone says they've been through, but maybe no one really has. What will I find wedged in a wall or lurking in the dark around the next turn?    I can't use the Capitan with illegal copies of anyone's stuff.    Apple didn't sell me this software. They still own it, in fact. I'm just borrowing it.    If I install more Apple software, those are on loan as well.    I can use the Capitan in two virtual Machines, plus once on my computer.    But these VM's cannot be used for business. The only exception is for software developers (I guess they wouldn't follow this rule anyways.)    I've got to read the separate rules that came with the fonts, and obey them. (I can only borrow those too.)    Those cool voices for the clock? — no remixing!    Slideshows made with Photo; same deal, don't even think about using them for some commercial purpose.    I can't sell access to my Mac via any kind of screen sharing.    I gotta run it on Apple hardware (no Hackintoshes).    I can't help anyone else do that.    I can make one copy as a backup.    I can't try to figure out the source code to any of this.    I gotta follow all my local laws while I'm using it. (!) (Really? Whereever I live?)    I can leave the software on the Mac if I sell it or give it away.    I better not use anyone else's hacked version.    Apple isn't responsible for my hurt feelings for anything I see on the web.    If I break any of these rules, this deal is over and I must immediately delete everything.    The Capitan is AS-IS, of course.    I can't send it to Sudan.    I cannot, don't even think about it, just plain can't, make money from MPEG/H.264/AVC videos I create. For that, I need to buy another something from somebody.There you are. I took one for the team.",
		"image":"https://dogweather.files.wordpress.com/2015/10/screen-shot-2015-10-17-at-3-31-48-pm.png?w=600&h=468"

	}
	

	]
}
